fishes_config/src/Documents/ПокупкаРыб/ПокупкаРыб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаРыб</name>
  <registerRecords>AccumulationRegister.ОстаткиПоРыбе</registerRecords>
  <tabularSections>
    <name>ПокупкаРыб_таблица</name>
    <attributes>
      <name>Аквариум</name>
      <type>
        <types>CatalogRef.Аквариумы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаРыб</name>
      <type>
        <types>CatalogRef.ПородыРыб</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fishes_config/src/AccumulationRegisters/ОстаткиПоРыбе/ОстаткиПоРыбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоРыбе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Аквариум</name>
    <type>
      <types>CatalogRef.Аквариумы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПородаРыб</name>
    <type>
      <types>CatalogRef.ПородыРыб</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fishes_config/src/Documents/ПокупкаРыб/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиПоРыбе.Записывать = Истина;
	
	Для Каждого Строка Из ПокупкаРыб_таблица Цикл
		Движение = Движения.ОстаткиПоРыбе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Движение.Аквариум = Строка.Аквариум;
		Движение.ПородаРыб = Строка.ПородаРыб;
		Движение.Количество = Строка.Количество;
		Движение.Стоимость = Строка.Сумма;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
